## Terraform data for `apps` stack
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Show Validation</summary>

```
Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
module.s42.random_password.postgres: Refreshing state... [id=none]
module.s42.module.istio.kubectl_manifest.virtual_services["app-s42"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/production/virtualservices/app-s42]
module.s42.random_password.next_auth_secret: Refreshing state... [id=none]
module.s42.module.jwtks_service.kubernetes_service.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.module.jwtks_service.kubernetes_deployment.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.module.interface.kubernetes_deployment.app[0]: Refreshing state... [id=production/interface]
module.s42.module.interface.kubernetes_service.app[0]: Refreshing state... [id=production/interface]
module.s42.module.api.kubernetes_service.app[0]: Refreshing state... [id=production/api]
module.s42.module.api.kubernetes_deployment.app[0]: Refreshing state... [id=production/api]
module.s42.module.webhooks_processor.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.postgres.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/postgres-data]
module.s42.module.postgres.kubernetes_service.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.postgres.kubernetes_config_map.app["config"]: Refreshing state... [id=production/postgres-config]
module.s42.kubernetes_config_map.stud42_config: Refreshing state... [id=production/stud42-config]
module.s42.module.crawler_campus.kubernetes_cron_job.app[0]: Refreshing state... [id=production/crawler-campus]
module.s42.module.crawler_locations.kubernetes_cron_job.app[0]: Refreshing state... [id=production/crawler-locations]
module.webhooked.module.webhooked.kubernetes_config_map.app["config"]: Refreshing state... [id=production/webhooked-config]
module.s42.module.jwtks_service.kubernetes_manifest.certificate["grpc-internal"]: Refreshing state...
module.webhooked.module.webhooked.kubernetes_service.app[0]: Refreshing state... [id=production/webhooked]
module.s42.kubernetes_secret.next_auth_secret: Refreshing state... [id=production/next-auth-secret]
module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.jwtks_service.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/interface]
module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/api]
module.s42.module.postgres.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.postgres.kubernetes_secret.app["credentials"]: Refreshing state... [id=production/postgres-credentials]
module.s42.kubernetes_manifest.rabbitmq: Refreshing state...
module.webhooked.module.secrets.kubernetes_manifest.sealed_secret["s42-webhooked-secrets"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["jwtks-service-certs-jwk"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["sentry-dsns"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["oauth2-providers"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["github-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["discord-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["s42-service-token"]: Refreshing state...
module.webhooked.module.webhooked.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooked]
module.webhooked.module.webhooked.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooked]
module.s42.kubernetes_pod_disruption_budget.rabbitmq: Refreshing state... [id=production/rabbitmq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.s42.random_password.meilisearch_token will be created
  + resource "random_password" "meilisearch_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.s42.module.api.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/api"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "0.18.3" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:0.18.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "api"
                        # (8 unchanged attributes hidden)

                      ~ env {
                          ~ name = "SENTRY_DSN" -> "SEARCHENGINE_MEILISEARCH_TOKEN"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "API_DSN" -> "MEILI_MASTER_KEY"
                                  ~ name     = "sentry-dsns" -> "meilisearch-token"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "CORS_ORIGIN" -> "SENTRY_DSN"
                          - value = "https://s42.app" -> null

                          + value_from {

                              + secret_key_ref {
                                  + key  = "API_DSN"
                                  + name = "sentry-dsns"
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "DATABASE_HOST" -> "CORS_ORIGIN"
                          ~ value = "postgres.production.svc.cluster.local" -> "https://s42.app"
                        }
                      ~ env {
                          ~ name  = "DATABASE_NAME" -> "DATABASE_HOST"
                          ~ value = "s42" -> "postgres.production.svc.cluster.local"
                        }
                      ~ env {
                          ~ name  = "DATABASE_URL" -> "DATABASE_NAME"
                          ~ value = "postgresql://postgres:$(DATABASE_PASSWORD)@$(DATABASE_HOST):5432/$(DATABASE_NAME)?sslmode=disable" -> "s42"
                        }
                      ~ env {
                          ~ name  = "GO_ENV" -> "DATABASE_URL"
                          ~ value = "production" -> "postgresql://postgres:$(DATABASE_PASSWORD)@$(DATABASE_HOST):5432/$(DATABASE_NAME)?sslmode=disable"
                        }
                      + env {
                          + name  = "GO_ENV"
                          + value = "production"
                        }
                      + env {
                          + name  = "SEARCHENGINE_MEILISEARCH_HOST"
                          + value = "http://meilisearch.production.svc.cluster.local:7700"
                        }

                        # (8 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/api"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.api.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/api"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.crawler_campus.kubernetes_cron_job.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job" "app" {
        id = "production/crawler-campus"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-campus"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
                      ~ "version"                      = "0.18.3" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "0.18.3" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (11 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:0.18.3" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-campus"
                                # (8 unchanged attributes hidden)

                                # (12 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.crawler_locations.kubernetes_cron_job.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job" "app" {
        id = "production/crawler-locations"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-locations"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
                      ~ "version"                      = "0.18.3" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "0.18.3" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (11 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:0.18.3" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-locations"
                                # (8 unchanged attributes hidden)

                              ~ env {
                                  ~ name = "SENTRY_DSN" -> "SEARCHENGINE_MEILISEARCH_TOKEN"

                                  ~ value_from {

                                      ~ secret_key_ref {
                                          ~ key      = "API_DSN" -> "MEILI_MASTER_KEY"
                                          ~ name     = "sentry-dsns" -> "meilisearch-token"
                                            # (1 unchanged attribute hidden)
                                        }
                                    }
                                }
                              ~ env {
                                  ~ name  = "DATABASE_HOST" -> "SENTRY_DSN"
                                  - value = "postgres.production.svc.cluster.local" -> null

                                  + value_from {

                                      + secret_key_ref {
                                          + key  = "API_DSN"
                                          + name = "sentry-dsns"
                                        }
                                    }
                                }
                              ~ env {
                                  ~ name  = "DATABASE_NAME" -> "DATABASE_HOST"
                                  ~ value = "s42" -> "postgres.production.svc.cluster.local"
                                }
                              ~ env {
                                  ~ name  = "DATABASE_URL" -> "DATABASE_NAME"
                                  ~ value = "postgresql://postgres:$(DATABASE_PASSWORD)@$(DATABASE_HOST):5432/$(DATABASE_NAME)?sslmode=disable" -> "s42"
                                }
                              ~ env {
                                  ~ name  = "DEBUG" -> "DATABASE_URL"
                                  ~ value = "true" -> "postgresql://postgres:$(DATABASE_PASSWORD)@$(DATABASE_HOST):5432/$(DATABASE_NAME)?sslmode=disable"
                                }
                              ~ env {
                                  ~ name  = "GO_ENV" -> "DEBUG"
                                  ~ value = "production" -> "true"
                                }
                              + env {
                                  + name  = "GO_ENV"
                                  + value = "production"
                                }
                              + env {
                                  + name  = "SEARCHENGINE_MEILISEARCH_HOST"
                                  + value = "http://meilisearch.production.svc.cluster.local:7700"
                                }

                                # (6 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.interface.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/interface"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "0.18.3" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:0.18.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "interface"
                        # (8 unchanged attributes hidden)

                        # (19 unchanged blocks hidden)
                    }

                    # (4 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/interface"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.interface.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/interface"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.jwtks_service.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/jwtks-service"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "0.18.3" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:0.18.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "jwtks-service"
                        # (8 unchanged attributes hidden)

                        # (10 unchanged blocks hidden)
                    }

                    # (5 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.jwtks_service.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/jwtks-service"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.jwtks_service.kubernetes_manifest.certificate["grpc-internal"] will be updated in-place
  ~ resource "kubernetes_manifest" "certificate" {
      ~ manifest = {
          ~ metadata   = {
              ~ labels    = {
                  ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
                  ~ version                        = "0.18.3" -> "latest"
                    # (5 unchanged elements hidden)
                }
                name      = "jwtks-service-grpc-internal"
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ labels                     = {
                  - "app"                          = "jwtks-service"
                  - "app.kubernetes.io/created-by" = "github-actions"
                  - "app.kubernetes.io/managed-by" = "terraform"
                  - "app.kubernetes.io/part-of"    = "jwtks-service"
                  - "app.kubernetes.io/version"    = "0.18.3"
                  - "kubernetes.io/name"           = "jwtks-service"
                  - "version"                      = "0.18.3"
                } -> (known after apply)
                name                       = "jwtks-service-grpc-internal"
                # (14 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

  # module.s42.module.jwtks_service.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/jwtks-service"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.meilisearch.kubernetes_deployment.app[0] will be created
  + resource "kubernetes_deployment" "app" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "meilisearch"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "meilisearch"
              + "app.kubernetes.io/version"    = "v0.30"
              + "kubernetes.io/name"           = "meilisearch"
              + "version"                      = "v0.30"
            }
          + name             = "meilisearch"
          + namespace        = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 2

          + selector {
              + match_labels = {
                  + "kubernetes.io/name" = "meilisearch"
                }
            }

          + strategy {
              + type = "RollingUpdate"

              + rolling_update {
                  + max_surge       = "1"
                  + max_unavailable = "0"
                }
            }

          + template {
              + metadata {
                  + annotations      = {
                      + "prometheus.io/path"   = "/metrics"
                      + "prometheus.io/port"   = "8080"
                      + "prometheus.io/scrape" = "false"
                    }
                  + generation       = (known after apply)
                  + labels           = {
                      + "app"                          = "meilisearch"
                      + "app.kubernetes.io/created-by" = "github-actions"
                      + "app.kubernetes.io/managed-by" = "terraform"
                      + "kubernetes.io/name"           = "meilisearch"
                      + "version"                      = "v0.30"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + node_selector                    = {
                      + "nodepool" = "small"
                    }
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + args                       = []
                      + command                    = []
                      + image                      = "getmeili/meilisearch:v0.30"
                      + image_pull_policy          = "IfNotPresent"
                      + name                       = "meilisearch"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "MEILI_MASTER_KEY"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "MEILI_MASTER_KEY"
                                  + name = "meilisearch-token"
                                }
                            }
                        }
                      + env {
                          + name  = "MEILI_ENV"
                          + value = "production"
                        }

                      + port {
                          + container_port = 7700
                          + name           = "http-app"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "memory" = "256Mi"
                            }
                          + requests = {
                              + "cpu"    = "100m"
                              + "memory" = "128Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = false
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_group               = "1000"
                          + run_as_non_root            = true
                          + run_as_user                = "1000"
                        }

                      + volume_mount {
                          + mount_path        = "/meili_data"
                          + mount_propagation = "None"
                          + name              = "data"
                          + read_only         = false
                        }
                    }

                  + image_pull_secrets {
                      + name = "ghcr-creds"
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + security_context {
                      + fs_group        = "1000"
                      + run_as_group    = "1000"
                      + run_as_non_root = true
                      + run_as_user     = "1000"
                    }

                  + volume {
                      + name = "data"

                      + persistent_volume_claim {
                          + claim_name = "meilisearch-data"
                          + read_only  = false
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.meilisearch.kubernetes_persistent_volume_claim.app["data"] will be created
  + resource "kubernetes_persistent_volume_claim" "app" {
      + id               = (known after apply)
      + wait_until_bound = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "meilisearch"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "meilisearch"
              + "app.kubernetes.io/version"    = "v0.30"
              + "kubernetes.io/name"           = "meilisearch"
              + "version"                      = "v0.30"
            }
          + name             = "meilisearch-data"
          + namespace        = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes       = [
              + "ReadWriteOnce",
            ]
          + storage_class_name = "csi-cinder-high-speed"
          + volume_name        = (known after apply)

          + resources {
              + requests = {
                  + "storage" = "1Gi"
                }
            }
        }
    }

  # module.s42.module.meilisearch.kubernetes_secret.app["token"] will be created
  + resource "kubernetes_secret" "app" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + immutable                      = false
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "meilisearch"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "meilisearch"
              + "app.kubernetes.io/version"    = "v0.30"
              + "kubernetes.io/name"           = "meilisearch"
              + "version"                      = "v0.30"
            }
          + name             = "meilisearch-token"
          + namespace        = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.s42.module.meilisearch.kubernetes_service.app[0] will be created
  + resource "kubernetes_service" "app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "meilisearch"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "meilisearch"
              + "app.kubernetes.io/version"    = "v0.30"
              + "kubernetes.io/name"           = "meilisearch"
              + "version"                      = "v0.30"
            }
          + name             = "meilisearch"
          + namespace        = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "kubernetes.io/name" = "meilisearch"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + name        = "http-app"
              + node_port   = (known after apply)
              + port        = 7700
              + protocol    = "TCP"
              + target_port = "7700"
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/webhooks-processor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "0.18.3" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:0.18.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "webhooks-processor"
                        # (8 unchanged attributes hidden)

                      ~ env {
                          ~ name = "SENTRY_DSN" -> "SEARCHENGINE_MEILISEARCH_TOKEN"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "WEBHOOKS_PROCESSOR_DSN" -> "MEILI_MASTER_KEY"
                                  ~ name     = "sentry-dsns" -> "meilisearch-token"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                          ~ name = "POD_IP" -> "SENTRY_DSN"

                          ~ value_from {

                              - field_ref {
                                  - api_version = "v1" -> null
                                  - field_path  = "status.podIP" -> null
                                }

                              + secret_key_ref {
                                  + key  = "WEBHOOKS_PROCESSOR_DSN"
                                  + name = "sentry-dsns"
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "AMQP_URL" -> "POD_IP"
                          - value = "amqp://$(RABBITMQ_USER):$(RABBITMQ_PASSWORD)@$(RABBITMQ_HOST).cluster.local:$(RABBITMQ_PORT)/" -> null

                          + value_from {

                              + field_ref {
                                  + api_version = "v1"
                                  + field_path  = "status.podIP"
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "DATABASE_HOST" -> "AMQP_URL"
                          ~ value = "postgres.production.svc.cluster.local" -> "amqp://$(RABBITMQ_USER):$(RABBITMQ_PASSWORD)@$(RABBITMQ_HOST).cluster.local:$(RABBITMQ_PORT)/"
                        }
                      ~ env {
                          ~ name  = "DATABASE_NAME" -> "DATABASE_HOST"
                          ~ value = "s42" -> "postgres.production.svc.cluster.local"
                        }
                      ~ env {
                          ~ name  = "DATABASE_URL" -> "DATABASE_NAME"
                          ~ value = "postgresql://postgres:$(DATABASE_PASSWORD)@$(DATABASE_HOST):5432/$(DATABASE_NAME)?sslmode=disable" -> "s42"
                        }
                      ~ env {
                          ~ name  = "DEBUG" -> "DATABASE_URL"
                          ~ value = "true" -> "postgresql://postgres:$(DATABASE_PASSWORD)@$(DATABASE_HOST):5432/$(DATABASE_NAME)?sslmode=disable"
                        }
                      ~ env {
                          ~ name  = "GO_ENV" -> "DEBUG"
                          ~ value = "production" -> "true"
                        }
                      + env {
                          + name  = "GO_ENV"
                          + value = "production"
                        }
                      + env {
                          + name  = "SEARCHENGINE_MEILISEARCH_HOST"
                          + value = "http://meilisearch.production.svc.cluster.local:7700"
                        }

                        # (10 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/webhooks-processor"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "0.18.3" -> "latest"
              ~ "version"                      = "0.18.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 14 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: apps-tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "apps-tfplan"

```
</details>